import UIKit

/*

22,13,4,67,7,12,98,23,70,5,53,43,82,19,37,16,8,32



소수를 내림차순으로 출력하세요  소수: 자기자신을 1과 자신의 숫자로만 나누어지는 수



13,67,7,23,5,53,43,19,37  - 9개

 

67,53,73,37,23,19,13,7,5

*/

var nums = [22,13,4,67,7,12,98,23,15,70,49,5,53,43,82,19,37,16,8,32]

var prime:[Int] = []

big:for n in nums{
    
    for i in 2..<n{
      //  print(i, n , n % i == 0)
        if n % i == 0{
            continue big
        }
    }
    //print(n,">>>>>>>>>>")
    
    
    prime.append(n)
}

print(prime.sorted(by: >))




